-----------------------
#### More about lambda function but first a little bit about python `sorted` function
-----------------------
- The `sorted()` function `returns a sorted list` from the items in an iterable.

- The sorted() function sorts the elements of a given `iterable` in a specific order (either ascending or descending) and returns the sorted iterable as a list.

- The `syntax` of the sorted() function is:

    - **sorted(iterable, key=None, reverse=False)**
    
- `Parameters` for the sorted() function

    - `sorted()` can take a maximum of 3 parameters:

        - `iterable` - A sequence (string, tuple, list) or collection (set, dictionary, frozen set) or any other iterator.
        - `reverse` (Optional) - If True, the sorted list is reversed (or sorted in descending order). Defaults to False if not provided.
        - `key` (Optional) - A function that serves as a key for the sort comparison. Defaults to None.

##### Example 1: Sort string, list, and tuple

In [3]:
# vowels list
py_list = ['e', 'a', 'u', 'o', 'i']
print(sorted(py_list))

# string
py_string = 'Python'
print(sorted(py_string))

# vowels tuple
py_tuple = ('e', 'a', 'u', 'o', 'i')
print(sorted(py_tuple))

['a', 'e', 'i', 'o', 'u']
['P', 'h', 'n', 'o', 't', 'y']
['a', 'e', 'i', 'o', 'u']

**in all cases above a sorted function returns `list`**

##### Example 2: Sort in descending order

- The `sorted()` function accepts a `reverse` parameter as an `optional` argument.

- Setting `reverse = True` sorts the iterable in the descending order.

In [7]:
# set
py_set = {'e', 'a', 'u', 'o', 'i'}
print(sorted(py_set, reverse=True))

# dictionary
py_dict = {'e': 1, 'a': 2, 'u': 3, 'o': 4, 'i': 5}
print(sorted(py_dict, reverse=True))

['u', 'o', 'i', 'e', 'a']
['u', 'o', 'i', 'e', 'a']

##### Example 3: Sort the list using sorted() having a key function

If you want your own implementation for sorting, `sorted()` also accepts a key function as an `optional` parameter.

Based on the returned value of the `key` function, you can `sort` the given `iterable`.

- sorted(iterable, key=len)

    - Here, len() is Python's in-built function to count the length of an object.

    - The list is sorted based on the length of the element, from the lowest count to highest.

In [10]:
# take the second element for sort
def take_second(elem):
    return elem[1]

In [12]:
# random list
random = [(2, 20), (3, 40), (4, 10), (1, 13)]

In [14]:
# sort list with key
sorted_list = sorted(random, key=take_second)

In [16]:
# print list
print('Sorted list:', sorted_list)

Sorted list: [(4, 10), (1, 13), (2, 20), (3, 40)]

##### Example 4: Sorting with multiple keys

In [19]:
# Let us suppose that we have the following list:

# Nested list of student's info in a Science Olympiad
# List elements: (Student's Name, Marks out of 100, Age)

participant_list = [
    ('Anish',   50, 18),
    ('Ram',     75, 12),
    ('David',   75, 20),
    ('Ronnie',  90, 22),
    ('Rakesh',  45, 12)
]

We want to sort the list in such a way that the student with the `highest marks is in the beginning`. 

In case the students have `equal marks`, they must be sorted so that the `younger` participant comes first.

In [22]:
def sorter(item):
    # Since highest marks first, least error = most marks
    error = 100 - item[1]
    age   = item[2]
    return (error, age)

In [24]:
for each_item in participant_list:
    print(each_item[0], '\t', sorter(each_item))

Anish 	 (50, 18)
Ram 	 (25, 12)
David 	 (25, 20)
Ronnie 	 (10, 22)
Rakesh 	 (55, 12)

Essentially we want the output in the `ascending` order of error (100 - marks)

In [29]:
sorted_list = sorted(participant_list, key=sorter)
print(sorted_list)

[('Ronnie', 90, 22), ('Ram', 75, 12), ('David', 75, 20), ('Anish', 50, 18), ('Rakesh', 45, 12)]

In [32]:
(10, 22) > (25, 12)

False

##### let us take a look at `lambda` function using `sorted` function

In [35]:
# Initializing list of dictionaries 
lis = [ { "name" : "Nandini", "age" : 20},  
        { "name" : "Anand",   "age" : 22 }, 
        { "name" : "Nikhil" , "age" : 19 }]

In [37]:
# using sorted and lambda to print list sorted by age  
print ("The list printed sorting by age: \n")

print (sorted(lis, key = lambda i: i['age']) )

The list printed sorting by age:

[{'name': 'Nikhil', 'age': 19}, {'name': 'Nandini', 'age': 20}, {'name': 'Anand', 'age': 22}]

In [39]:
# using sorted and lambda to print list sorted  
# by both age and name. Notice that "Manjeet" 
# now comes before "Nandini" 
print ("The list printed sorting by age and name: \n")
print (sorted(lis, key = lambda i: (i['age'], i['name'])) )

The list printed sorting by age and name:

[{'name': 'Nikhil', 'age': 19}, {'name': 'Nandini', 'age': 20}, {'name': 'Anand', 'age': 22}]

In [41]:
# using sorted and lambda to print list sorted 
# by age in descending order 
print ("The list printed sorting by age in descending order: \n")
print (sorted(lis, key = lambda i: i['age'],reverse=True) )

The list printed sorting by age in descending order:

[{'name': 'Anand', 'age': 22}, {'name': 'Nandini', 'age': 20}, {'name': 'Nikhil', 'age': 19}]

In [43]:
print ("The list printed sorting by age in descending order: \n")

sorted_list = sorted(lis, key = lambda i: i['age'],reverse=True) 

for i in sorted_list:
    print(i)

The list printed sorting by age in descending order:

{'name': 'Anand', 'age': 22}
{'name': 'Nandini', 'age': 20}
{'name': 'Nikhil', 'age': 19}

##### Applying lambda function to single column using Dataframe.assign()

In [47]:
# importing pandas library 
import pandas as pd 
import numpy as np

In [49]:
# creating and initializing a list 
values= [['Rohan',455],['Elvish', 250], ['Deepak',495], 
         ['Soni', 400],['Radhika',350],['Vansh', 450]]  
  
# creating a pandas dataframe 
df = pd.DataFrame(values,columns=['Name','Total_Marks']) 
df

      Name  Total_Marks
0    Rohan          455
1   Elvish          250
2   Deepak          495
3     Soni          400
4  Radhika          350
5    Vansh          450

In [51]:
# Applying lambda function to find  percentage of 'Total_Marks' column  
# using df.assign() 
df = df.assign(Percentage = lambda x: (x['Total_Marks'] /500 * 100)) 
  
# displaying the data frame 
df

      Name  Total_Marks  Percentage
0    Rohan          455        91.0
1   Elvish          250        50.0
2   Deepak          495        99.0
3     Soni          400        80.0
4  Radhika          350        70.0
5    Vansh          450        90.0

##### Applying lambda function to `multiple columns` using Dataframe.assign()

In [54]:
# creating and initializing a nested list 
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80], 
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90], 
               [51, 2.3, 111]] 
  
# creating a pandas dataframe 
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3']) 
  
# Applying lambda function to find  the product of 3 columns using  
# df.assign() 
df = df.assign(Product=lambda x: (x['Field_1'] * x['Field_2'] * x['Field_3'])) 
  
# printing dataframe 
df

   Field_1  Field_2  Field_3  Product
0       15      2.5      100   3750.0
1       20      4.5       50   4500.0
2       25      5.2       80  10400.0
3       45      5.8       48  12528.0
4       40      6.3       70  17640.0
5       41      6.4       90  23616.0
6       51      2.3      111  13020.3

##### Applying lambda function to single row using Dataframe.apply()

In [57]:
# creating and initializing a nested list 
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80], 
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90],  
               [51, 2.3, 111]] 
  
# creating a pandas dataframe 
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'], 
                  index=['a', 'b', 'c', 'd', 'e', 'f', 'g']) 
  
  
# Apply function numpy.square() to square 
# the values of one row only i.e. row  
# with index name 'd' 
df = df.apply(lambda x: np.square(x) if x.name == 'd' else x, axis=1) 
  
  
# printing dataframe 
df

   Field_1  Field_2  Field_3
a     15.0     2.50    100.0
b     20.0     4.50     50.0
c     25.0     5.20     80.0
d   2025.0    33.64   2304.0
e     40.0     6.30     70.0
f     41.0     6.40     90.0
g     51.0     2.30    111.0

##### Example ...Applying lambda function to multiple rows using Dataframe.apply()

In [60]:
# creating and initializing a nested list 
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80], 
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90], 
               [51, 2.3, 111]] 
  
# creating a pandas dataframe 
df = pd.DataFrame(values_list, 
                  columns=['Field_1', 'Field_2', 'Field_3'], 
                  index  =['a', 'b', 'c', 'd', 'e', 'f', 'g']) 
df

   Field_1  Field_2  Field_3
a       15      2.5      100
b       20      4.5       50
c       25      5.2       80
d       45      5.8       48
e       40      6.3       70
f       41      6.4       90
g       51      2.3      111

In [62]:
# Apply function numpy.square() to square the values of 3 rows only i.e. with row 
# index name 'a', 'e' and 'g' only 
df = df.apply(lambda x: np.square(x) if x.name in [ 'a', 'e', 'g'] else x, axis=1) 
  
# printing dataframe 
df

   Field_1  Field_2  Field_3
a    225.0     6.25  10000.0
b     20.0     4.50     50.0
c     25.0     5.20     80.0
d     45.0     5.80     48.0
e   1600.0    39.69   4900.0
f     41.0     6.40     90.0
g   2601.0     5.29  12321.0

#### Summarize

In [65]:
square = lambda x: x ** 2

# Test the lambda function
print(square(5))  # Output: 25
print(square(3))  # Output: 9

25
9

In [67]:
add = lambda x, y: x + y

# Test the lambda function
print(add(3, 5))   # Output: 8
print(add(-2, 7))  # Output: 5

8
5

In [69]:
# Checking Even Numbers
is_even = lambda x: x % 2 == 0

# Test the lambda function
print(is_even(4))  # Output: True
print(is_even(7))  # Output: False

True
False

In [72]:
# Reversing a String
reverse_string = lambda s: s[::-1]

# Test the lambda function
print(reverse_string("hello"))  # Output: "olleh"
print(reverse_string("python")) # Output: "nohtyp"

olleh
nohtyp

In [74]:
# Sorting List of Tuples
data = [(2, "apple"), (4, "orange"), (1, "banana"), (3, "grape")]

sorted_data = sorted(data, key=lambda x: x[1])

# Test the lambda function
print(sorted_data)  # Output: [(2, 'apple'), (1, 'banana'), (3, 'grape'), (4, 'orange')]

[(2, 'apple'), (1, 'banana'), (3, 'grape'), (4, 'orange')]